docs/uses.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Uses</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet"href="resources/org.css"type="text/css" /><header><a href="index.html">Home</a>&emsp;<a href="about.html">About Me</a>&emsp;<a href="https://github.com/abdrysdale/abdrysdale.github.io">Source</a>&emsp;<a href="sitemap.html">Sitemap</a>&emsp;<a href="feed.xml">RSS</a></header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Uses</h1>
<p>
This is a <a href="https://uses.tech/">uses</a> page.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">What?</th>
<th scope="col" class="org-left">How?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Boot-loader</td>
<td class="org-left">GNU + Linux + Fedora <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> <sup>, </sup><sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup></td>
</tr>

<tr>
<td class="org-left">OS</td>
<td class="org-left">Emacs</td>
</tr>

<tr>
<td class="org-left">Text editor</td>
<td class="org-left">Emacs <sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup></td>
</tr>

<tr>
<td class="org-left">To-dos</td>
<td class="org-left">Emacs (org-mode)</td>
</tr>

<tr>
<td class="org-left">Browser</td>
<td class="org-left">Emacs (eww), GNU IceCat</td>
</tr>

<tr>
<td class="org-left">eMail</td>
<td class="org-left">Emacs (notmuch) <sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup></td>
</tr>

<tr>
<td class="org-left">IRC</td>
<td class="org-left">Emacs (erc)</td>
</tr>

<tr>
<td class="org-left">RSS Reader</td>
<td class="org-left">Emacs (newsticker)</td>
</tr>

<tr>
<td class="org-left">Writing</td>
<td class="org-left">Emacs (org-mode + AUCTeX + RefTeX)</td>
</tr>

<tr>
<td class="org-left">Bibliography manager</td>
<td class="org-left">Emacs (ebib)</td>
</tr>

<tr>
<td class="org-left">Music Player</td>
<td class="org-left">Emacs (emm)</td>
</tr>

<tr>
<td class="org-left">Media Player</td>
<td class="org-left">MPV</td>
</tr>

<tr>
<td class="org-left">EBook Library</td>
<td class="org-left">Calibre</td>
</tr>

<tr>
<td class="org-left">Professional languages<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup></td>
<td class="org-left">Python, R, Fortran, SQL</td>
</tr>

<tr>
<td class="org-left">Hobby languages<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup></td>
<td class="org-left">Perl<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>, Elisp, Forth, Common Lisp</td>
</tr>

<tr>
<td class="org-left">Flirtation languages<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup></td>
<td class="org-left">Haskell, OCaml, Clojure, Lean4, Guile, Elixir, Rust</td>
</tr>
</tbody>
</table>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I previously used Gentoo but switched to Fedora due a bug I was having with external monitors not appearing after hibernation. This occurred late one night whilst writing my PhD thesis and I didn't have the time or mental energy to fix this so I decided to install Fedora. The bug persisted in Fedora and I've experienced a lot more bugs and crashes. As soon as I've got some spare time I will be switching back to Gentoo - it is far the most stable distro I've tried out of Ubuntu, Fedora, Manjaro, Arch, NixOS and Gentoo.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Unfortunately, I also have to use Windows for work.
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I previously used Vim for around 5 years. The scope of what I'm able to do now far exceeds what I was previously able to do with Vim. Prior to Emacs, the thought of spending days tinkering with my editor's configuration file would have seemed impossible! Emacs feels like a snug room that I've built myself with everything just so. A little retreat from the stresses of the modern world. Vim just always felt like a tool.
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Prior to Emacs, I used thunderbird for about a decade and had no complaints!
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5" role="doc-backlink">5</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
These are the languages that I consider myself fluent in and use for my day job.
</p></div></div>

<div class="footdef"><sup><a id="fn.6" class="footnum" href="#fnr.6" role="doc-backlink">6</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
These languages I use for hobby projects. I've written some decent projects in these but I'd need to build up some more experience and knowledge of best practices before I'd feel comfortable subjecting some future employee to a maintenance burden.
</p></div></div>

<div class="footdef"><sup><a id="fn.7" class="footnum" href="#fnr.7" role="doc-backlink">7</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
I suffer from a common Perl related vision problem whereby I can write Perl but I can't read it - not even my own.
</p></div></div>

<div class="footdef"><sup><a id="fn.8" class="footnum" href="#fnr.8" role="doc-backlink">8</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
These languages I've read a book or two about along with spending a lot of my day thinking about them. If I was given the green-light to do some work using one of these languages I'd ditch my tried and trusted languages in a heart-beat; and then most likely come crawling back, cap in hand, having realized I fallen into the trap of <i>"the grass is always greener"</i>.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2025-04-22 Tue 00:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
